Revit 2026 API

# PipeSettingsConnectorTolerance Property

---

The connector tolerance value.

**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double ConnectorTolerance { get; set; }
```
```vb
Public Property ConnectorTolerance As Double
	Get
	Set
```
```cpp
public:
property double ConnectorTolerance {
	double get ();
	void set (double value);
}
```
```fsharp
member ConnectorTolerance : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for dValue is not finite |

#### Reference

PipeSettings Class

Autodesk.Revit.DB.Plumbing Namespace